---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GlobalParameterFailures.InvalidElementPropToGlobalParamLink
source: html/f75d9b2b-f31d-1841-19e4-09cf4b60ff90.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GlobalParameterFailures.InvalidElementPropToGlobalParamLink Property

The following parameters of the highlighted element can no longer be linked to global parameters: %1!s!.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidElementPropToGlobalParamLink { get; }
```